IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM20_CONTROLSS_G3_EPWM20.xml
	<register id="CONTROLSS_G3_EPWM20_XCMP2_ACTIVE" acronym="CONTROLSS_G3_EPWM20_XCMP2_ACTIVE" offset="0x604" width="32" description="Additional Compare 2 Active Register">
		<bitfield id="XCMP2_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP2_ACTIVE Register The value in the XCMP2_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP2HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP2HR_ACTIVE Register  The value in the XCMP2HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM20_XCMP3_ACTIVE" acronym="CONTROLSS_G3_EPWM20_XCMP3_ACTIVE" offset="0x608" width="32" description="Additional Compare 3 Active Register">
		<bitfield id="XCMP3_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP3_ACTIVE Register The value in the XCMP3_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP3HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP3HR_ACTIVE Register  The value in the XCMP3HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM20_XCMP4_ACTIVE" acronym="CONTROLSS_G3_EPWM20_XCMP4_ACTIVE" offset="0x60C" width="32" description="Additional Compare 4 Active Register">
		<bitfield id="XCMP4_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP4_ACTIVE Register The value in the XCMP4_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP4HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP4HR_ACTIVE Register  The value in the XCMP4HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM20_XCMP5_ACTIVE" acronym="CONTROLSS_G3_EPWM20_XCMP5_ACTIVE" offset="0x610" width="32" description="Additional Compare 5 Active Register">
		<bitfield id="XCMP5_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP5_ACTIVE Register The value in the XCMP5_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP5HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP5HR_ACTIVE Register  The value in the XCMP5HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM20_XCMP6_ACTIVE" acronym="CONTROLSS_G3_EPWM20_XCMP6_ACTIVE" offset="0x614" width="32" description="Additional Compare 6 Active Register">
		<bitfield id="XCMP6_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP6_ACTIVE Register The value in the XCMP6_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP6HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP6HR_ACTIVE Register  The value in the XCMP6HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM20_XCMP7_ACTIVE" acronym="CONTROLSS_G3_EPWM20_XCMP7_ACTIVE" offset="0x618" width="32" description="Additional Compare 7 Active Register">
		<bitfield id="XCMP7_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP7_ACTIVE Register The value in the XCMP7_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP7HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP7HR_ACTIVE Register  The value in the XCMP7HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM20_XCMP8_ACTIVE" acronym="CONTROLSS_G3_EPWM20_XCMP8_ACTIVE" offset="0x61C" width="32" description="Additional Compare 8 Active Register">
		<bitfield id="XCMP8_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP8_ACTIVE Register The value in the XCMP8_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP8HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP8HR_ACTIVE Register  The value in the XCMP8HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM20_XTBPRD_ACTIVE" acronym="CONTROLSS_G3_EPWM20_XTBPRD_ACTIVE" offset="0x620" width="32" description="Additional Time Base Period Active Register">
		<bitfield id="XTBPRD_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="The value in the XTBPRD_ACTIVE register is loaded into TBPRD [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XTBPRDHR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="The value in the XTBPRDHR_ACTIVE register is loaded into TBPRDHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM20_XAQCTLA_ACTIVE" acronym="CONTROLSS_G3_EPWM20_XAQCTLA_ACTIVE" offset="0x630" width="16" description="AQCTLA Active Register">
		<bitfield id="XCMP8" width="2" begin="15" end="14" resetval="0x0" description="Action when Counter = CMP8 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="XCMP7" width="2" begin="13" end="12" resetval="0x0" description="Action when Counter = CMP7 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="XCMP6" width="2" begin="11" end="10" resetval="0x0" description="Action when Counter = CMP6 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="XCMP5" width="2" begin="9" end="8" resetval="0x0" description="Action when Counter = CMP5 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="XCMP4" width="2" begin="7" end="6" resetval="0x0" description="Action when Counter = CMP4 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="XCMP3" width="2" begin="5" end="4" resetval="0x0" description="Action when Counter = CMP3 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="XCMP2" width="2" begin="3" end="2" resetval="0x0" description="Action when Counter = CMP2 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="XCMP1" width="2" begin="1" end="0" resetval="0x0" description="Action when Counter = CMP1 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM20_XMINMAX_ACTIVE" acronym="CONTROLSS_G3_EPWM20_XMINMAX_ACTIVE" offset="0x644" width="32" description="XMINMAX Active Register">
		<bitfield id="XMIN_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="The value in the XMIN_ACTIVE register is used for comparision against the threshold of the capture counter at any given time." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XMAX_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="The value in the XMAX_ACTIVE register is used for comparision against the threshold of the capture counter at any given time." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM20_XCMP1_SHDW1" acronym="CONTROLSS_G3_EPWM20_XCMP1_SHDW1" offset="0x680" width="32" description="Additional Compare 1 Shadow 1 Register">
		<bitfield id="XCMP1_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP1_SHDW1 Register The value in the XCMP1_SHDW1 register is loaded into XCMP1_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP1HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP1HR_SHDW1 Register  The value in the XCMP1HR_SHDW1 register is loaded into XCMP1HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
